{
  "news": [
    {
      "title": "Kickstart 2025 with smart money habits",
      "content": "The new year is all about fresh starts. With 2025 fast approaching, it’s the perfect time to reflect on your finances and take steps to set yourself up for success. The holiday season may bring extra expenses, but it’s also an opportunity to start building better financial habits for the year ahead. Here’s how to review, reset, and prepare for a financially confident 2025:",
      "date": "2024-12-19",
      "category": "Investment",
      "source": "https://www.fundwisecapital.com.au/post/kickstart-2025-with-smart-money-habits"
    },
    {
      "title": "2024 in review, what to expect from 2025",
      "content": "Can you believe the year is almost over? With the end of 2024 fast approaching, it’s time to take a look at the highlights reel of what happened in the property world this year and what’s in store for 2025.",
      "date": "2024-12-18",
      "category": "People",
      "source": "https://www.fundwisecapital.com.au/post/2024-in-review-what-to-expect-from-2025"
    },
    {
      "title": "Bridging Loans: A solution for buying before selling",
      "content": "In a fast-moving property market, timing is everything. You may find your dream home before selling your current one, but without the right financial solution, you could miss out. That’s where a bridging loan can help.A bridging loan allows you to buy your next home before selling your current property, giving you the financial flexibility to secure your next home, potentially avoid unnecessary costs, and sell on your own terms. Here’s a quick guide to how bridging loans work and how they can benefit you.",
      "date": "2024-12-17",
      "category": "Finance",
      "source": "https://www.fundwisecapital.com.au/post/bridging-loans-a-solution-for-buying-before-selling"
    },
    {
      "title": "December Finance Focus",
      "content": "Summer has arrived, and while the mercury continues to rise across the nation, the property market is cooling.According to CoreLogic data, property prices increased 0.1% in November – the weakest Australia-wide result since January 2023.Nationally, prices grew 5.5% over the year. The median value of a house is now $812,933.For savvy investors or aspiring homeowners, it could be a good time to consider purchasing while price growth is subdued.In other news, the federal government’s Help to Buy bill has been passed into law by parliament. The scheme will allow eligible home buyers to co-purchase a home with the government. The federal government will provide an “equity contribution” of up to 40 per cent of the cost of a new home or 30 per cent for existing homes.If you’re interested in finding out more about the eligibility criteria for the Help to Buy scheme, or you want to organise pre-approval on finance for a property purchase, chat to us today.",
      "date": "2024-12-16",
      "category": "Finance",
      "source": "https://www.fundwisecapital.com.au/post/december-finance-focus-2"
    },
    {
      "title": "RBA Cash Rate Announcement",
      "content": "At its final meeting of 2024, the Reserve Bank of Australia (RBA) kept the cash rate on hold at 4.35 per cent. The decision was widely expected, with headline inflation trending lower. The numbers are largely pointing towards a possible cash rate cut in the first half of 2025.Read today’s official statement on the RBA’s website.",
      "date": "2024-12-09",
      "category": "Finance",
      "source": "https://www.fundwisecapital.com.au/post/rba-cash-rate-announcement-21"
    },
    {
      "title": "3 must-know tips to limit surprises on settlement day",
      "content": "Settlement day marks the long-awaited moment when you become the legal owner of your new home, and while it’s thrilling, it can also bring a few last-minute challenges. With the right preparation, though, you can help ensure a smooth handover and avoid surprises. Here’s your guide to navigating potential settlement pitfalls and making your big day a success.",
      "date": "2024-12-01",
      "category": "People",
      "source": "https://www.fundwisecapital.com.au/post/3-must-know-tips-to-limit-surprises-on-settlement-day"
    },
    {
      "title": "Why choose a mortgage broker to refinance?",
      "content": "Did you know that seven out of 10 borrowers use a mortgage broker? During the June 2024 quarter, mortgage brokers wrote 73.7% of all new home loans in Australia – the second highest result on record. When it comes to refinancing, many borrowers choose to use a mortgage broker for peace of mind that switching is the right move for them. Here’s why many borrowers are using a mortgage broker to refinance, rather than going direct to a lender.",
      "date": "2024-11-30",
      "category": "Business",
      "source": "https://www.fundwisecapital.com.au/post/why-choose-a-mortgage-broker-to-refinance"
    },
    {
      "title": "Will house prices keep rising in 2025?",
      "content": "Amid cost-of-living pressures and mortgage repayment stress, there has been some good news for homeowners. Property prices have continued to rise for months on end across the nation. In October, data from CoreLogic showed property values increased by 0.3% nationally. It was the 21st consecutive month of price growth across the country. Recently, Australia’s property market also reached a new milestone. For the first time ever, the total value of residential real estate climbed to $11 trillion, according to CoreLogic. Property values in Sydney, Brisbane, Adelaide and Perth are all currently at a record high. So, will housing prices keep rising in 2025? Let’s take a look at what we know. ",
      "date": "2024-11-29",
      "category": "People",
      "source": "https://www.fundwisecapital.com.au/post/will-house-prices-keep-rising-in-2025"
    },
    {
      "title": "November Finance Focus",
      "content": "The busy spring selling season has seen many aspiring homeowners out and about looking for the perfect property to snap up. Property prices continue to rise (up 0.3% nationally in October), but recently we’ve seen price growth slowing and the market cooling. If you’re planning to be in a new home before the new year, make sure you get your finance pre-approved early. That way, you’ll be able to dive in when you find the right property for your needs. ",
      "date": "2024-11-28",
      "category": "Finance",
      "source": "https://www.fundwisecapital.com.au/post/november-finance-focus-2"
    },
    {
      "title": "RBA Cash Rate Announcement",
      "content": "Luck was on the side of homeowners this Melbourne Cup Day, with the Reserve Bank of Australia (RBA) keeping the cash rate on hold at 4.35 per cent at today’s meeting.Read today’s official statement on the RBA’s website. The last RBA board meeting for the year will be on 9-10 December.",
      "date": "2024-11-05",
      "category": "Finance",
      "source": "https://www.fundwisecapital.com.au/post/rba-cash-rate-announcement-20"
    },
    {
      "title": "What type of home loan do I need?",
      "content": "When you’re new to buying property, choosing a home loan can be overwhelming. There are dozens of different lenders out there all offering different types of mortgages. So, which is right for you? A mortgage broker can help you select the right home loan, based on your specific financial situation and goals. Here are some of the main options.",
      "date": "2024-10-18",
      "category": "People",
      "source": "https://www.fundwisecapital.com.au/post/what-type-of-home-loan-do-i-need"
    },
    {
      "title": "5 tips for choosing a property manager for your rental",
      "content": "When you rent out your investment property, you can choose to manage the property yourself or get a professional property manager to do the hard yards for you.The key benefit of getting someone else to manage your property is the convenience factor. You won’t be the one organising tradespeople if the property floods or the heater blows up. A professional property manager can help maximise your returns by finding high-quality tenants, conducting thorough background checks, and ensuring their financials are sound, all while minimising vacancies. Property managers offer a range of services, which may include: Rent advice Leasing expertise and advertising services Management of contracts Advice about tenancy legislation Inspections and hands-on management of your property. Here are some tips for choosing the right property manager.",
      "date": "2024-10-17",
      "category": "Investment",
      "source": "https://www.fundwisecapital.com.au/post/5-tips-for-choosing-a-property-manager-for-your-rental"
    },
    {
      "title": "When will interest rates drop?",
      "content": "Homeowners have been waiting with bated breath to see when the Reserve Bank of Australia (RBA) will cut the cash rate. It’s been on hold at 4.35% since November 2023.Some hoped a cash rate cut may come after the US Federal Reserve cut interest rates by 0.50 per cent last month, joining other countries like New Zealand, Canada and the UK in giving homeowners a reprieve. However, so far the RBA Board has held firm about the need to maintain a restrictive monetary policy for the time being. Some economists believe it could still happen this year, while most say early 2025 is more likely.",
      "date": "2024-10-16",
      "category": "Investment",
      "source": "https://www.fundwisecapital.com.au/post/when-will-interest-rates-drop"
    },
    {
      "title": "October Finance Focus",
      "content": "As housing supply ramps up in spring, we’ve seen property values inch higher nationally, but growth has slowed. With prices coming down in four capital cities during the September quarter – Melbourne, Canberra, Hobart and Darwin – savvy property hunters will no doubt be on the lookout for a bargain. And with the flow of new listings coming onto the market tracking 3.2% higher than a year ago nationally, there may be plenty of properties to choose from. Make sure you get your finance pre-approved with us so that you can dive in with confidence when you do find the property you’re looking for.",
      "date": "2024-10-15",
      "category": "Finance",
      "source": "https://www.fundwisecapital.com.au/post/october-finance-focus-2"
    },
    {
      "title": "RBA Cash Rate Announcement",
      "content": "The Reserve Bank of Australia (RBA) kept the cash rate on hold at 4.35 per cent at today’s meeting. The latest inflation data is set to be released on 25 September, and today’s decision seems to confirm that inflation in Australia continues to slow. Read today’s official statement on the RBA’s website. The board's next cash rate announcement will be on 5 November.",
      "date": "2024-09-25",
      "category": "Finance",
      "source": "https://www.fundwisecapital.com.au/post/rba-cash-rate-announcement-19"
    }
  ]
}
